<!-- terraform cdk action for options with hash 3caa6358613d4cff1c3d8606eebcf5ca -->
### ✅ Successfully planned Terraform CDK Stack 'graasp-dev'



<details><summary>Show Plan</summary>

```shell
npm warn deprecated inflight@1.0.6: This module is not supported, and leaks memory. Do not use it. Check out lru-cache if you want a good and tested way to coalesce async requests by a key value, which is much more comprehensive and powerful.
npm warn deprecated lodash.isequal@4.5.0: This package is deprecated. Use require('node:util').isDeepStrictEqual instead.
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
graasp-dev  Initializing the backend...
graasp-dev  Successfully configured the backend "s3"! Terraform will automatically
            use this backend unless the backend configuration changes.
graasp-dev  Initializing modules...
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.13.0 for graasp-dev-postgres_db_F1D5DB7A...
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance_role_association in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance_role_association
            - graasp-dev-postgres_db_F1D5DB7A.db_option_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_option_group
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_parameter_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_parameter_group
            - graasp-dev-postgres_db_F1D5DB7A.db_subnet_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 6.4.1 for vpc...
graasp-dev  - vpc in .terraform/modules/vpc
graasp-dev  Initializing provider plugins...
            - Finding hashicorp/random versions matching ">= 3.1.0"...
graasp-dev  - Finding hashicorp/aws versions matching ">= 5.92.0, >= 6.0.0, 6.17.0"...
graasp-dev  - Installing hashicorp/aws v6.17.0...
graasp-dev  - Installed hashicorp/aws v6.17.0 (signed by HashiCorp)
graasp-dev  - Installing hashicorp/random v3.7.2...
graasp-dev  - Installed hashicorp/random v3.7.2 (signed by HashiCorp)
            Terraform has created a lock file .terraform.lock.hcl to record the provider
            selections it made above. Include this file in your version control repository
            so that Terraform can guarantee to make the same selections by default when
            you run "terraform init" in the future.
graasp-dev  Terraform has been successfully initialized!

            You may now begin working with Terraform. Try running "terraform plan" to see
            any changes that are required for your infrastructure. All Terraform commands
            should now work.

            If you ever set or change modules or backend configuration for Terraform,
            rerun this command to reinitialize your working directory. If you forget, other
            commands will detect it and remind you to do so if necessary.
graasp-dev  - Fetching hashicorp/aws 6.17.0 for linux_amd64...
graasp-dev  - Retrieved hashicorp/aws 6.17.0 for linux_amd64 (signed by HashiCorp)
graasp-dev  - Fetching hashicorp/random 3.7.2 for linux_amd64...
graasp-dev  - Retrieved hashicorp/random 3.7.2 for linux_amd64 (signed by HashiCorp)
            - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
            - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
graasp-dev  Success! Terraform has validated the lock file and found no need for changes.
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=18i6pw]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Reading...
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Read complete after 0s [id=arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Reading...
            data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Reading...
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-library-graasp-library-loggroup_67C0597D (graasp-dev/graasp-library-graasp-library-loggroup): Refreshing state... [id=/ecs/graasp-library]
            data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Reading...
            data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Reading...
            aws_iam_role.graasp-dev_ecs-execution-role_A4D135E8 (graasp-dev/ecs-execution-role): Refreshing state... [id=graasp-dev-ecs-execution-role]
            aws_cloudfront_function.maintenance-check-function (maintenance-check-function): Refreshing state... [id=maintenance-check]
            aws_cloudwatch_log_group.graasp-dev_graasp-core-loggroup_49E5FDD5 (graasp-dev/graasp-core-loggroup): Refreshing state... [id=/ecs/core]
graasp-dev  aws_service_discovery_http_namespace.graasp-dev_namespace_B6F7BA2C (graasp-dev/namespace): Refreshing state... [id=ns-us3rov3ukfoth5ox]
            aws_cloudfront_origin_request_policy.single-origin_allow-all-origin-request-policy_29149208 (single-origin/allow-all-origin-request-policy): Refreshing state... [id=918ac8f0-a112-49fa-91d3-c0e9e1e8e8b5]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_meilisearch-meilisearch-loggroup_68770DFD (graasp-dev/meilisearch-meilisearch-loggroup): Refreshing state... [id=/ecs/meilisearch]
graasp-dev  aws_s3_bucket.graasp-dev-maintenance_bucket_46B8FAD7 (graasp-dev-maintenance/bucket): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bf44cfeb4bd6c5a3]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
            aws_cloudwatch_log_group.graasp-dev_iframely-iframely-loggroup_7A5EFF5D (graasp-dev/iframely-iframely-loggroup): Refreshing state... [id=/ecs/iframely]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_umami-umami-loggroup_8EC61F18 (graasp-dev/umami-umami-loggroup): Refreshing state... [id=/ecs/umami]
graasp-dev  aws_s3_bucket.graasp-dev-apps_bucket_F4170225 (graasp-dev-apps/bucket): Refreshing state... [id=graasp-dev-apps]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=graasp-postgres15-20250414081855175500000002]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_etherpad-etherpad-loggroup_DC4C6E70 (graasp-dev/etherpad-etherpad-loggroup): Refreshing state... [id=/ecs/etherpad]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_admin-admin-loggroup_BBF3EA20 (graasp-dev/admin-admin-loggroup): Refreshing state... [id=/ecs/admin]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Read complete after 1s [id=arn:aws:acm:eu-central-1:299720865162:certificate/af9d071d-3aa1-4583-905d-ec1efd5515d3]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_workers-graasp-worker-loggroup_7B2C3B66 (graasp-dev/workers-graasp-worker-loggroup): Refreshing state... [id=/ecs/graasp-worker]
graasp-dev  data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Read complete after 1s [id=graasp/etherpad]
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Read complete after 1s [id=graasp/explore]
graasp-dev  aws_ecr_repository.graasp-dev-admin-ecr (graasp-dev-admin-ecr): Refreshing state... [id=graasp/admin]
graasp-dev  aws_ecs_cluster.cluster (cluster): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:cluster/graasp-dev]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Read complete after 1s [id=graasp]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_migrate-loggroup_3BA4455E (graasp-dev/migrate-loggroup): Refreshing state... [id=/ecs/migrate]
graasp-dev  aws_cloudfront_origin_access_control.single-origin_client-origin-access-control_AACB4CDA (single-origin/client-origin-access-control): Refreshing state... [id=E1SSFJV3NCD0KB]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-nudenet-loggroup_2DD18C1A (graasp-dev/graasp-nudenet-loggroup): Refreshing state... [id=/ecs/nudenet]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Reading...
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
graasp-dev  aws_s3_bucket.graasp-dev-h5p_bucket_B545A43B (graasp-dev-h5p/bucket): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket.graasp-dev-file-items_bucket_12606B30 (graasp-dev-file-items/bucket): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_iam_role.graasp-dev_admin-ecsExec-task-role_4A498ED2 (graasp-dev/admin-ecsExec-task-role): Refreshing state... [id=admin-ecsExec-task-role]
graasp-dev  aws_s3_bucket.graasp-dev-assets_bucket_8930785E (graasp-dev-assets/bucket): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_redis-redis-loggroup_AAC20219 (graasp-dev/redis-redis-loggroup): Refreshing state... [id=/ecs/redis]
graasp-dev  aws_rds_instance_state.graasp-dev-postgres_graasp-dev-instance-state_D3812C30 (graasp-dev-postgres/graasp-dev-instance-state): Refreshing state...
graasp-dev  aws_ecs_task_definition.graasp-dev_meilisearch_38A3D0B6 (graasp-dev/meilisearch): Refreshing state... [id=meilisearch]
graasp-dev  aws_iam_role_policy.graasp-dev_graasp-dev-ecs-execution-role-policies_D65DB830 (graasp-dev/graasp-dev-ecs-execution-role-policies): Refreshing state... [id=graasp-dev-ecs-execution-role:allow-ecr-pull]
graasp-dev  aws_ecs_task_definition.graasp-dev_redis_E9CE963D (graasp-dev/redis): Refreshing state... [id=redis]
graasp-dev  aws_ecs_task_definition.graasp-dev_iframely_4C5E8E3D (graasp-dev/iframely): Refreshing state... [id=iframely]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role]
graasp-dev  aws_ecs_task_definition.graasp-dev_graasp-library_B38B90C0 (graasp-dev/graasp-library): Refreshing state... [id=graasp-library]
graasp-dev  aws_ecr_lifecycle_policy.graasp-dev-admin-ecr-lifecycle (graasp-dev-admin-ecr-lifecycle): Refreshing state... [id=graasp/admin]
graasp-dev  aws_iam_role_policy.graasp-dev_admin-ecsExec-task-policy_8B69D2B0 (graasp-dev/admin-ecsExec-task-policy): Refreshing state... [id=admin-ecsExec-task-role:admin-allow-ecsExec-task-policy]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role-20250414084120276500000001]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-maintenance_s3-block-public-access_C8FD87F8 (graasp-dev-maintenance/s3-block-public-access): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-maintenance_s3-bucket-ownership_1588A828 (graasp-dev-maintenance/s3-bucket-ownership): Refreshing state... [id=graasp-dev-maintenance]
            data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Reading...
            aws_s3_bucket_website_configuration.graasp-dev-maintenance_s3-website-configuration_50149944 (graasp-dev-maintenance/s3-website-configuration): Refreshing state... [id=graasp-dev-maintenance]
            data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Read complete after 0s [id=2448502661]
graasp-dev  aws_s3_bucket_policy.graasp-dev-maintenance_s3-policy_DA8583B1 (graasp-dev-maintenance/s3-policy): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-098c10ef23e4e97a2]
graasp-dev  module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-037dfd30c09bfcb76]
graasp-dev  module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06d794b86c4c0da00]
graasp-dev  aws_security_group.graasp-dev-admin-security-group (graasp-dev-admin-security-group): Refreshing state... [id=sg-03f531ebc3968b029]
graasp-dev  aws_security_group.graasp-dev-meilisearch-security-group (graasp-dev-meilisearch-security-group): Refreshing state... [id=sg-08169b93b254b8ff1]
graasp-dev  aws_security_group.graasp-dev-library-security-group (graasp-dev-library-security-group): Refreshing state... [id=sg-0aafc89bbf5739dec]
graasp-dev  aws_security_group.graasp-dev-migrate-security-group (graasp-dev-migrate-security-group): Refreshing state... [id=sg-0d16557816b4f5845]
graasp-dev  aws_security_group.graasp-dev-collab-ec2_graasp-dev-collab-ec2-security-group_B3318A54 (graasp-dev-collab-ec2/graasp-dev-collab-ec2-security-group): Refreshing state... [id=sg-07e7a273f47d0059f]
graasp-dev  aws_security_group.graasp-dev-workers-security-group (graasp-dev-workers-security-group): Refreshing state... [id=sg-0a5008ca479f08b55]
graasp-dev  aws_security_group.graasp-dev-etherpad-security-group (graasp-dev-etherpad-security-group): Refreshing state... [id=sg-0fb56b52d54eed5fe]
graasp-dev  aws_security_group.graasp-dev-iframely-security-group (graasp-dev-iframely-security-group): Refreshing state... [id=sg-077b04c8f8e6f2ac3]
graasp-dev  aws_security_group.graasp-dev-lb-security-group (graasp-dev-lb-security-group): Refreshing state... [id=sg-043a4fe55b6817b2e]
graasp-dev  aws_security_group.graasp-dev-umami-security-group (graasp-dev-umami-security-group): Refreshing state... [id=sg-00f73c597e1b44822]
graasp-dev  aws_security_group.graasp-dev-redis-security-group (graasp-dev-redis-security-group): Refreshing state... [id=sg-020ca00c65d7e1104]
graasp-dev  aws_security_group.graasp-dev-gatekeeper_graasp-dev-gatekeeper-security-group_92E8E7CC (graasp-dev-gatekeeper/graasp-dev-gatekeeper-security-group): Refreshing state... [id=sg-0750d0af113e7da99]
graasp-dev  aws_security_group.graasp-dev-backend-security-group (graasp-dev-backend-security-group): Refreshing state... [id=sg-0436bcdc892abda80]
graasp-dev  aws_security_group.graasp-dev-postgres_graasp-dev-db-security-group_6A637215 (graasp-dev-postgres/graasp-dev-db-security-group): Refreshing state... [id=sg-0186fec9af0593f12]
graasp-dev  module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03a1732c7868cbe45]
graasp-dev  module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01238f26eab523423]
graasp-dev  module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d1e3ea211d674e32]
graasp-dev  module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01b78c34d5d13db83]
graasp-dev  module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ba3740950e70cb0c]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-apps_s3-website-configuration_7E3F72D4 (graasp-dev-apps/s3-website-configuration): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-apps_s3-block-public-access_05DA1D21 (graasp-dev-apps/s3-block-public-access): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-apps_s3-bucket-ownership_699CAAD9 (graasp-dev-apps/s3-bucket-ownership): Refreshing state... [id=graasp-dev-apps]
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Read complete after 0s [id=4070198440]
graasp-dev  aws_cloudfront_distribution.graasp-dev-maintenance-cloudfront (graasp-dev-maintenance-cloudfront): Refreshing state... [id=EGBVR5KHBTMNX]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-admin-allow-all (graasp-dev-admin-allow-all): Refreshing state... [id=sgr-00c7c7dd0771fb129]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-meilisearch-allow-all (graasp-dev-meilisearch-allow-all): Refreshing state... [id=sgr-0c557c5df90d9f78f]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-library-allow-all (graasp-dev-library-allow-all): Refreshing state... [id=sgr-0acf665253d4a959e]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-migrate-allow-all (graasp-dev-migrate-allow-all): Refreshing state... [id=sgr-0a1a3408abed57c60]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-graasp-workers (graasp-dev-meilisearch-allow-graasp-workers): Refreshing state... [id=sgr-07134fbc48d9f0370]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-workers-allow-all (graasp-dev-workers-allow-all): Refreshing state... [id=sgr-0f47b2336d6b948c6]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-allow-inbound-ssh_3DB04F43 (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-allow-inbound-ssh): Refreshing state... [id=sgr-0fadcf8107635838d]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-allow-all_EAB27BEF (graasp-dev-collab-ec2/graasp-dev-collab-ec2-allow-all): Refreshing state... [id=sgr-01760ca1d2b09b31d]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-etherpad-allow-all (graasp-dev-etherpad-allow-all): Refreshing state... [id=sgr-0f73c6c3f604ce026]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-iframely-allow-all (graasp-dev-iframely-allow-all): Refreshing state... [id=sgr-058fd07c2e3c0ca9c]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-migrate-allow-load-balancer (graasp-dev-migrate-allow-load-balancer): Refreshing state... [id=sgr-00a9608239e7b401e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http-ipv6_91743348 (graasp-dev-load-balancer/allow-http-ipv6): Refreshing state... [id=sgr-07a0b4bf0b0b05c26]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https_0223BC47 (graasp-dev-load-balancer/allow-https): Refreshing state... [id=sgr-01b616a803edeaaea]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-load-balancer_graasp-dev-allow-all_001EC5EB (graasp-dev-load-balancer/graasp-dev-allow-all): Refreshing state... [id=sgr-09bb82356feba0ad5]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https-ipv6_DC496355 (graasp-dev-load-balancer/allow-https-ipv6): Refreshing state... [id=sgr-05d6f5da0f311d43b]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http_0E987E63 (graasp-dev-load-balancer/allow-http): Refreshing state... [id=sgr-00b388210e5b20ee6]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-admin-allow-load-balancer (graasp-dev-admin-allow-load-balancer): Refreshing state... [id=sgr-086e9f39fea0bf332]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-library-allow-load-balancer (graasp-dev-library-allow-load-balancer): Refreshing state... [id=sgr-04e5abe17e05bdb43]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-allow-load-balancer (graasp-dev-etherpad-allow-load-balancer): Refreshing state... [id=sgr-0038ad3fb0fd9b85c]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-allow-load-balancer_5A9E5B7D (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-allow-load-balancer): Refreshing state... [id=sgr-0335bfdb2cc780431]
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Read complete after 0s [id=1897348743]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-h5p_s3-cors-config_EC778FA8 (graasp-dev-h5p/s3-cors-config): Refreshing state... [id=graasp-dev-h5p]
            aws_s3_bucket_public_access_block.graasp-dev-h5p_s3-block-public-access_2D472005 (graasp-dev-h5p/s3-block-public-access): Refreshing state... [id=graasp-dev-h5p]
            aws_s3_bucket_website_configuration.graasp-dev-h5p_s3-website-configuration_5FB93898 (graasp-dev-h5p/s3-website-configuration): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-h5p_s3-bucket-ownership_418B795B (graasp-dev-h5p/s3-bucket-ownership): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-umami-allow-all (graasp-dev-umami-allow-all): Refreshing state... [id=sgr-0a4b672f07f1f7f06]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-umami-allow-load-balancer (graasp-dev-umami-allow-load-balancer): Refreshing state... [id=sgr-033af50dc63b13835]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-redis-allow-all (graasp-dev-redis-allow-all): Refreshing state... [id=sgr-0412ca85ae48a1b51]
            aws_vpc_security_group_ingress_rule.graasp-dev-redis-allow-graasp-workers (graasp-dev-redis-allow-graasp-workers): Refreshing state... [id=sgr-03e8a1c5d35d7f3c3]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-file-items_s3-block-public-access_DD6519C0 (graasp-dev-file-items/s3-block-public-access): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-file-items_s3-bucket-ownership_9BB45BB8 (graasp-dev-file-items/s3-bucket-ownership): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-file-items_s3-cors-config_531774F3 (graasp-dev-file-items/s3-cors-config): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-assets_s3-bucket-ownership_1BE1C46A (graasp-dev-assets/s3-bucket-ownership): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-assets_s3-website-configuration_6D1735B5 (graasp-dev-assets/s3-website-configuration): Refreshing state... [id=graasp-dev-assets]
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Read complete after 0s [id=661570887]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-assets_s3-block-public-access_D15DF7EF (graasp-dev-assets/s3-block-public-access): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-inbound-ssh_1B8A7117 (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-inbound-ssh): Refreshing state... [id=sgr-0f7356c9cf32076cb]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-admin (graasp-dev-allow-gatekeeper-on-admin): Refreshing state... [id=sgr-0eeebe9111fc9da49]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-meilisearch (graasp-dev-allow-gatekeeper-on-meilisearch): Refreshing state... [id=sgr-085ff897e11bd0fb9]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-all_B66B414C (graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-all): Refreshing state... [id=sgr-0b8bcf954253fa037]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-backend-allow-all (graasp-dev-backend-allow-all): Refreshing state... [id=sgr-07ece93d643cfee3b]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-redis-allow-graasp-backend (graasp-dev-redis-allow-graasp-backend): Refreshing state... [id=sgr-0d733de6d47147a48]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-backend-allow-load-balancer (graasp-dev-backend-allow-load-balancer): Refreshing state... [id=sgr-0f1f77b71f42b1d09]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-graasp-backend (graasp-dev-meilisearch-allow-graasp-backend): Refreshing state... [id=sgr-0a2b0a600a592bbd8]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-iframely-allow-graasp-backend (graasp-dev-iframely-allow-graasp-backend): Refreshing state... [id=sgr-077d8da6e2cc0d208]
graasp-dev  aws_s3_bucket_policy.graasp-dev-apps_s3-policy_708B7B00 (graasp-dev-apps/s3-policy): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-postgres_graasp-dev-db-allow-all_0D9DEE53 (graasp-dev-postgres/graasp-dev-db-allow-all): Refreshing state... [id=sgr-0b1d7df1d0b572110]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-admin_04B093C2 (graasp-dev-postgres/graasp-dev-db-allow-admin): Refreshing state... [id=sgr-0c39dcc49b6f5c264]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-collab_84D960AC (graasp-dev-postgres/graasp-dev-db-allow-collab): Refreshing state... [id=sgr-025c50d209417f463]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-backend_E8883EF3 (graasp-dev-postgres/graasp-dev-db-allow-graasp-backend): Refreshing state... [id=sgr-0c8a4b2f6cbb26e73]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-workers_FD8833CD (graasp-dev-postgres/graasp-dev-db-allow-graasp-workers): Refreshing state... [id=sgr-01793faf4d2f17a65]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-migrate_3CAD125A (graasp-dev-postgres/graasp-dev-db-allow-graasp-migrate): Refreshing state... [id=sgr-091095b461efdaf81]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-etherpad_A95D382C (graasp-dev-postgres/graasp-dev-db-allow-etherpad): Refreshing state... [id=sgr-08c74707423701596]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-umami_425B5740 (graasp-dev-postgres/graasp-dev-db-allow-umami): Refreshing state... [id=sgr-0cb47913649149e5e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-postgres (graasp-dev-allow-gatekeeper-on-postgres): Refreshing state... [id=sgr-0f51375e8183b1850]
graasp-dev  module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ba3740950e70cb0c1080289494]
graasp-dev  module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0c8012f7c5ce4295b]
graasp-dev  module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-043bdec968b8bf547]
graasp-dev  module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c2145269b26cde3d]
graasp-dev  aws_cloudfront_distribution.graasp-dev-apps-cloudfront (graasp-dev-apps-cloudfront): Refreshing state... [id=E354WPS1CZ652D]
graasp-dev  aws_s3_bucket_policy.graasp-dev-h5p_s3-policy_9DB0282E (graasp-dev-h5p/s3-policy): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_policy.graasp-dev-assets_s3-policy_B5DD3F7D (graasp-dev-assets/s3-policy): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_cloudfront_distribution.graasp-dev-h5p-cloudfront (graasp-dev-h5p-cloudfront): Refreshing state... [id=E3B7XJV46O4VB4]
graasp-dev  aws_cloudfront_distribution.graasp-dev-assets-cloudfront (graasp-dev-assets-cloudfront): Refreshing state... [id=E1TTPMNH8QPMJP]
graasp-dev  aws_ecs_service.graasp-dev_iframely-service_8F7B5C1F (graasp-dev/iframely-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/iframely]
graasp-dev  aws_lb.graasp-dev-load-balancer_lb_9A06B77C (graasp-dev-load-balancer/lb): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:loadbalancer/app/graasp-dev/56a9113b6597302d]
graasp-dev  aws_ecs_service.graasp-dev_redis-service_1DBE7C83 (graasp-dev/redis-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/redis]
graasp-dev  aws_instance.graasp-dev-collab-ec2_graasp-dev-collab-ec2-ec2_21E539AF (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-ec2): Refreshing state... [id=i-010fb0f2995015d49]
graasp-dev  aws_instance.graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_A55DD5DA (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-ec2): Refreshing state... [id=i-083a7df3c14e7f171]
graasp-dev  aws_ecs_service.graasp-dev_meilisearch-service_3A736F80 (graasp-dev/meilisearch-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/meilisearch]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=graasp-dev-20250414081855174100000001]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-CBDUST2Z7F3GRTCVXX4RJPFEXY]
graasp-dev  aws_ecs_task_definition.graasp-dev_etherpad_D664EB2D (graasp-dev/etherpad): Refreshing state... [id=etherpad]
graasp-dev  aws_ecs_task_definition.graasp-dev_umami_88984772 (graasp-dev/umami): Refreshing state... [id=umami]
graasp-dev  aws_ecs_task_definition.graasp-dev_admin_965ADA45 (graasp-dev/admin): Refreshing state... [id=admin]
            aws_ecs_task_definition.graasp-dev_graasp_54E40EB5 (graasp-dev/graasp): Refreshing state... [id=graasp]
            aws_ecs_task_definition.graasp-dev_migrate-task-definition_44AD51A2 (graasp-dev/migrate-task-definition): Refreshing state... [id=migrate]
            aws_ecs_task_definition.graasp-dev_workers_516311C6 (graasp-dev/workers): Refreshing state... [id=workers]
graasp-dev  aws_ecs_service.graasp-dev_workers-service_05D25197 (graasp-dev/workers-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/workers]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-http-redirect_309E2C64 (graasp-dev-load-balancer/lb-listener-http-redirect): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/56a9113b6597302d/dfc9fe7ce2ba4ccb]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-https_E069C227 (graasp-dev-load-balancer/lb-listener-https): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7]
graasp-dev  aws_appautoscaling_target.graasp-dev_workers-service-autoscaling-target_9102DCDC (graasp-dev/workers-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/workers]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-shortener_2A4B0FBC (graasp-dev-load-balancer/graasp-dev-shortener): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/c39ba7c2d5b6bbef]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-player_6D261351 (graasp-dev-load-balancer/graasp-dev-player): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/886734ff71834f83]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-auth_E1CC888F (graasp-dev-load-balancer/graasp-dev-auth): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/ce14b1dabb320fe5]
            aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-analytics_431AD7A3 (graasp-dev-load-balancer/graasp-dev-analytics): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/b607a2be8a64b9a1]
graasp-dev  aws_lb_target_group.graasp-dev-collab-ec2_graasp-dev-collab-ec2-target-group_18F9878E (graasp-dev-collab-ec2/graasp-dev-collab-ec2-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-dev-collab-ec2/0caa23e50a1abee9]
            aws_lb_target_group.graasp-dev_graasp-target-group_7E05BC31 (graasp-dev/graasp-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp/c888b92d0abf031c]
            aws_lb_target_group.graasp-dev_graasp-library-target-group_47035354 (graasp-dev/graasp-library-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-library/09aa407d374eeee4]
graasp-dev  aws_lb_target_group.graasp-dev_etherpad-target-group_94F8091C (graasp-dev/etherpad-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/etherpad/c311d4269d04f108]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-account_E8E1BF85 (graasp-dev-load-balancer/graasp-dev-account): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/479dd05beed6f5d7]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-association_09BDA0F8 (graasp-dev-load-balancer/graasp-dev-association): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/5eec4df5716c0849]
graasp-dev  aws_lb_target_group.graasp-dev_admin-target-group_02D6E066 (graasp-dev/admin-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/admin/9c6f956df4b46e27]
graasp-dev  aws_lb_target_group.graasp-dev_umami-target-group_02AC6A93 (graasp-dev/umami-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/umami/77272badc864c038]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-builder_4D040462 (graasp-dev-load-balancer/graasp-dev-builder): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/4b57545bd7c09fa1]
graasp-dev  aws_appautoscaling_policy.graasp-dev_workers-service-autoscaling-policy_F3FE6A26 (graasp-dev/workers-service-autoscaling-policy): Refreshing state... [id=workers]
graasp-dev  aws_ec2_instance_state.graasp-dev-collab-ec2_graasp-dev-collab-ec2-state_9B7E66CC (graasp-dev-collab-ec2/graasp-dev-collab-ec2/graasp-dev-collab-ec2-state): Refreshing state... [id=i-010fb0f2995015d49]
graasp-dev  aws_ec2_instance_state.graasp-dev-gatekeeper_graasp-dev-gatekeeper-state_94AC11BD (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-state): Refreshing state... [id=i-083a7df3c14e7f171]
graasp-dev  aws_ecs_service.graasp-dev_graasp-service_BD538BD2 (graasp-dev/graasp-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-rule_8589AD50 (graasp-dev/graasp-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/a861aca569be4e5b]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-library-rule_AC381C09 (graasp-dev/graasp-library-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/414e93764bf83448]
graasp-dev  aws_ecs_service.graasp-dev_graasp-library-service_35621E15 (graasp-dev/graasp-library-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp-library]
graasp-dev  aws_lb_target_group_attachment.graasp-dev-collab-ec2_graasp-dev-collab-ec2-target-group-attachement_E18BD97B (graasp-dev-collab-ec2/graasp-dev-collab-ec2-target-group-attachement): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-dev-collab-ec2/0caa23e50a1abee9-20250811145659683100000001]
graasp-dev  aws_lb_listener_rule.graasp-dev-collab-ec2_graasp-dev-collab-ec2-rule_6E87D208 (graasp-dev-collab-ec2/graasp-dev-collab-ec2-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/7eb207705573ff68]
graasp-dev  aws_lb_listener_rule.graasp-dev_etherpad-rule_74CA3679 (graasp-dev/etherpad-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/1b021896eed36d28]
graasp-dev  aws_ecs_service.graasp-dev_etherpad-service_366B5CFC (graasp-dev/etherpad-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/etherpad]
graasp-dev  aws_lb_listener_rule.graasp-dev_admin-rule_5C1B7745 (graasp-dev/admin-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/e1c44d5ebb218198]
graasp-dev  aws_ecs_service.graasp-dev_admin-service_102046E6 (graasp-dev/admin-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/admin]
graasp-dev  aws_ecs_service.graasp-dev_umami-service_6A875906 (graasp-dev/umami-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/umami]
graasp-dev  aws_lb_listener_rule.graasp-dev_umami-rule_139819E3 (graasp-dev/umami-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7/4ff1443c29e346a6]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-service-autoscaling-target_517CCDCE (graasp-dev/graasp-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-library-service-autoscaling-target_5E0ABD4D (graasp-dev/graasp-library-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-service-autoscaling-policy_70C429DA (graasp-dev/graasp-service-autoscaling-policy): Refreshing state... [id=graasp]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-library-service-autoscaling-policy_E718A88F (graasp-dev/graasp-library-service-autoscaling-policy): Refreshing state... [id=graasp-library]
graasp-dev  Terraform used the selected providers to generate the following execution
            plan. Resource actions are indicated with the following symbols:
              + create
             <= read (data resources)

            Terraform will perform the following actions:
graasp-dev  # data.aws_iam_policy_document.single-origin_client-bucket-policy-document_B64D2046 (single-origin/client-bucket-policy-document) will be read during apply
              # (config refers to values not yet known)
             <= data "aws_iam_policy_document" "single-origin_client-bucket-policy-document_B64D2046" {
                  + id            = (known after apply)
                  + json          = (known after apply)
                  + minified_json = (known after apply)

                  + statement {
                      + actions   = [
                          + "s3:GetObject",
                        ]
                      + effect    = "Allow"
                      + resources = [
                          + (known after apply),
                        ]
                      + sid       = "AllowCloudfrontToRead"

                      + condition {
                          + test     = "StringEquals"
                          + values   = [
                              + (known after apply),
                            ]
                          + variable = "AWS:SourceArn"
                        }

                      + principals {
                          + identifiers = [
                              + "cloudfront.amazonaws.com",
                            ]
                          + type        = "Service"
                        }
                    }
                }

              # aws_cloudfront_distribution.single-origin_graasp-origin-cf-distribution_D3FB237C (single-origin/graasp-origin-cf-distribution) will be created
              + resource "aws_cloudfront_distribution" "single-origin_graasp-origin-cf-distribution_D3FB237C" {
                  + aliases                         = [
                      + "dev.graasp.org",
                    ]
                  + arn                             = (known after apply)
                  + caller_reference                = (known after apply)
                  + comment                         = "Graasp Origin CloudFront Distribution"
                  + continuous_deployment_policy_id = (known after apply)
                  + default_root_object             = "index.html"
                  + domain_name                     = (known after apply)
                  + enabled                         = true
                  + etag                            = (known after apply)
                  + hosted_zone_id                  = (known after apply)
                  + http_version                    = "http2"
                  + id                              = (known after apply)
                  + in_progress_validation_batches  = (known after apply)
                  + is_ipv6_enabled                 = true
                  + last_modified_time              = (known after apply)
                  + price_class                     = "PriceClass_All"
                  + retain_on_delete                = false
                  + staging                         = false
                  + status                          = (known after apply)
                  + tags_all                        = {
                      + "terraform-managed" = "true"
                    }
                  + trusted_key_groups              = (known after apply)
                  + trusted_signers                 = (known after apply)
                  + wait_for_deployment             = true

                  + default_cache_behavior {
                      + allowed_methods        = [
                          + "GET",
                          + "HEAD",
                          + "OPTIONS",
                        ]
                      + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
                      + cached_methods         = [
                          + "GET",
                          + "HEAD",
                        ]
                      + compress               = false
                      + default_ttl            = (known after apply)
                      + max_ttl                = (known after apply)
                      + min_ttl                = 0
                      + target_origin_id       = "s3-origin"
                      + trusted_key_groups     = (known after apply)
                      + trusted_signers        = (known after apply)
                      + viewer_protocol_policy = "redirect-to-https"

                      + grpc_config (known after apply)
                    }

                  + ordered_cache_behavior {
                      + allowed_methods          = [
                          + "DELETE",
                          + "GET",
                          + "HEAD",
                          + "OPTIONS",
                          + "PATCH",
                          + "POST",
                          + "PUT",
                        ]
                      + cache_policy_id          = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
                      + compress                 = false
                      + default_ttl              = (known after apply)
                      + max_ttl                  = (known after apply)
                      + min_ttl                  = 0
                      + origin_request_policy_id = "918ac8f0-a112-49fa-91d3-c0e9e1e8e8b5"
                      + path_pattern             = "/api/*"
                      + target_origin_id         = "api-origin"
                      + viewer_protocol_policy   = "redirect-to-https"

                      + grpc_config (known after apply)
                    }

                  + origin {
                      + connection_attempts         = 3
                      + connection_timeout          = 10
                      + domain_name                 = "dev.graasp.org/api"
                      + origin_id                   = "api-origin"
                      + response_completion_timeout = (known after apply)
                        # (2 unchanged attributes hidden)

                      + custom_origin_config {
                          + http_port                = 80
                          + https_port               = 443
                          + origin_keepalive_timeout = 5
                          + origin_protocol_policy   = "https-only"
                          + origin_read_timeout      = 30
                          + origin_ssl_protocols     = [
                              + "TLSv1.2",
                            ]
                            # (1 unchanged attribute hidden)
                        }
                    }
                  + origin {
                      + connection_attempts         = 3
                      + connection_timeout          = 10
                      + domain_name                 = (known after apply)
                      + origin_access_control_id    = "E1SSFJV3NCD0KB"
                      + origin_id                   = "s3-origin"
                      + response_completion_timeout = (known after apply)
                        # (1 unchanged attribute hidden)
                    }

                  + restrictions {
                      + geo_restriction {
                          + locations        = (known after apply)
                          + restriction_type = "none"
                        }
                    }

                  + viewer_certificate {
                      + acm_certificate_arn      = "arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2"
                      + minimum_protocol_version = "TLSv1"
                      + ssl_support_method       = "sni-only"
                    }
                }

              # aws_lb_listener_rule.single-origin-core-rule (single-origin-core-rule) will be created
              + resource "aws_lb_listener_rule" "single-origin-core-rule" {
                  + arn          = (known after apply)
                  + id           = (known after apply)
                  + listener_arn = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/56a9113b6597302d/3c2efeadaad693e7"
                  + priority     = 20
                  + region       = "eu-central-1"
                  + tags_all     = {
                      + "terraform-managed" = "true"
                    }

                  + action {
                      + order            = (known after apply)
                      + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp/c888b92d0abf031c"
                      + type             = "forward"
                    }

                  + condition {
                      + host_header {
                          + values = [
                              + "dev.graasp.org",
                            ]
                        }
                    }
                  + condition {
                      + path_pattern {
                          + values = [
                              + "/api/*",
                            ]
                        }
                    }
                }

              # aws_s3_bucket.single-origin_client-bucket_A5D90019 (single-origin/client-bucket) will be created
              + resource "aws_s3_bucket" "single-origin_client-bucket_A5D90019" {
                  + acceleration_status         = (known after apply)
                  + acl                         = (known after apply)
                  + arn                         = (known after apply)
                  + bucket                      = "client"
                  + bucket_domain_name          = (known after apply)
                  + bucket_prefix               = (known after apply)
                  + bucket_region               = (known after apply)
                  + bucket_regional_domain_name = (known after apply)
                  + force_destroy               = false
                  + hosted_zone_id              = (known after apply)
                  + id                          = (known after apply)
                  + object_lock_enabled         = (known after apply)
                  + policy                      = (known after apply)
                  + region                      = "eu-central-1"
                  + request_payer               = (known after apply)
                  + tags_all                    = {
                      + "terraform-managed" = "true"
                    }
                  + website_domain              = (known after apply)
                  + website_endpoint            = (known after apply)

                  + cors_rule (known after apply)

                  + grant (known after apply)

                  + lifecycle_rule (known after apply)

                  + logging (known after apply)

                  + object_lock_configuration (known after apply)

                  + replication_configuration (known after apply)

                  + server_side_encryption_configuration (known after apply)

                  + versioning (known after apply)

                  + website (known after apply)
                }

              # aws_s3_bucket_policy.single-origin_client-bucket-policy_A40BF4BB (single-origin/client-bucket-policy) will be created
              + resource "aws_s3_bucket_policy" "single-origin_client-bucket-policy_A40BF4BB" {
                  + bucket = (known after apply)
                  + id     = (known after apply)
                  + policy = (known after apply)
                  + region = "eu-central-1"
                }

            Plan: 4 to add, 0 to change, 0 to destroy.

            ─────────────────────────────────────────────────────────────────────────────

            Saved the plan to: plan

            To perform exactly these actions, run the following command to apply:
                terraform apply "plan"


```

</details>